Courses/7140/Lectures/Examples/Telegram-Problem/telegram-problem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Peter Naur's "Telegram Problem"</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Peter Naur's "Telegram Problem""/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-11T18:37-0400"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/7140/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Peter Naur's "Telegram Problem"</h1>

<ol>
<li>"Write a program that takes a number w, then accepts lines of text
   and outputs lines of text, where the output lines have as many
   words as possible but are never longer than w characters. Words may
   not be split, but you may assume that no single word is too long
   for a line."

</li>
<li>Originally described in 197x by Peter Naur, 2005 Turing Award
   Winner.

</li>
<li>This is essentially word-wrapping within a paragraph of a text
   editor.  "As such, it is a classic ObjectOriented problem, used as
   an example in the Design Patterns Book."

</li>
<li>It is surprisingly difficult to specify correctly, and to design
   a correct program in Java or C++.

</li>
<li>Do a requirement analysis.  E.g.: What assumptions must we make so that
   this problem is doable?
</li>
</ol>

</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
